JRWaugh/stm32f103-cpp-hal/Core/Inc/AFIO.h
/*
 * AFIO.h
 *
 *  Created on: 3 Jan 2021
 *      Author: krabb
 */

#ifndef SRC_AFIO_H_
#define SRC_AFIO_H_

#include "stm32f1xx.h"
#include <new>


#define IS_AFIO_EVENTOUT_PIN(__PIN__) (((__PIN__) == AFIO_EVCR_PIN_PX0) || \
		((__PIN__) == AFIO_EVCR_PIN_PX1) || \
		((__PIN__) == AFIO_EVCR_PIN_PX2) || \
		((__PIN__) == AFIO_EVCR_PIN_PX3) || \
		((__PIN__) == AFIO_EVCR_PIN_PX4) || \
		((__PIN__) == AFIO_EVCR_PIN_PX5) || \
		((__PIN__) == AFIO_EVCR_PIN_PX6) || \
		((__PIN__) == AFIO_EVCR_PIN_PX7) || \
		((__PIN__) == AFIO_EVCR_PIN_PX8) || \
		((__PIN__) == AFIO_EVCR_PIN_PX9) || \
		((__PIN__) == AFIO_EVCR_PIN_PX10) || \
		((__PIN__) == AFIO_EVCR_PIN_PX11) || \
		((__PIN__) == AFIO_EVCR_PIN_PX12) || \
		((__PIN__) == AFIO_EVCR_PIN_PX13) || \
		((__PIN__) == AFIO_EVCR_PIN_PX14) || \
		((__PIN__) == AFIO_EVCR_PIN_PX15))

#define IS_AFIO_EVENTOUT_PORT(__PORT__) (((__PORT__) == AFIO_EVCR_PORT_PA) || \
		((__PORT__) == AFIO_EVCR_PORT_PB) || \
		((__PORT__) == AFIO_EVCR_PORT_PC) || \
		((__PORT__) == AFIO_EVCR_PORT_PD) || \
		((__PORT__) == AFIO_EVCR_PORT_PE))

/**
 * @brief Enable the remapping of SPI1 alternate function NSS, SCK, MISO and MOSI.
 * @note  ENABLE: Remap     (NSS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5)
 * @retval None
 */
#define __HAL_AFIO_REMAP_SPI1_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_SPI1_REMAP)

/**
 * @brief Disable the remapping of SPI1 alternate function NSS, SCK, MISO and MOSI.
 * @note  DISABLE: No remap (NSS/PA4,  SCK/PA5, MISO/PA6, MOSI/PA7)
 * @retval None
 */
#define __HAL_AFIO_REMAP_SPI1_DISABLE()  AFIO_REMAP_DISABLE(AFIO_MAPR_SPI1_REMAP)

/**
 * @brief Enable the remapping of I2C1 alternate function SCL and SDA.
 * @note  ENABLE: Remap     (SCL/PB8, SDA/PB9)
 * @retval None
 */
#define __HAL_AFIO_REMAP_I2C1_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_I2C1_REMAP)

/**
 * @brief Disable the remapping of I2C1 alternate function SCL and SDA.
 * @note  DISABLE: No remap (SCL/PB6, SDA/PB7)
 * @retval None
 */
#define __HAL_AFIO_REMAP_I2C1_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_I2C1_REMAP)

/**
 * @brief Enable the remapping of USART1 alternate function TX and RX.
 * @note  ENABLE: Remap     (TX/PB6, RX/PB7)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART1_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_USART1_REMAP)

/**
 * @brief Disable the remapping of USART1 alternate function TX and RX.
 * @note  DISABLE: No remap (TX/PA9, RX/PA10)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART1_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_USART1_REMAP)

/**
 * @brief Enable the remapping of USART2 alternate function CTS, RTS, CK, TX and RX.
 * @note  ENABLE: Remap     (CTS/PD3, RTS/PD4, TX/PD5, RX/PD6, CK/PD7)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART2_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_USART2_REMAP)

/**
 * @brief Disable the remapping of USART2 alternate function CTS, RTS, CK, TX and RX.
 * @note  DISABLE: No remap (CTS/PA0, RTS/PA1, TX/PA2, RX/PA3, CK/PA4)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART2_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_USART2_REMAP)

/**
 * @brief Enable the remapping of USART3 alternate function CTS, RTS, CK, TX and RX.
 * @note  ENABLE: Full remap     (TX/PD8,  RX/PD9,  CK/PD10, CTS/PD11, RTS/PD12)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART3_ENABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_USART3_REMAP_FULLREMAP, AFIO_MAPR_USART3_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of USART3 alternate function CTS, RTS, CK, TX and RX.
 * @note  PARTIAL: Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART3_PARTIAL()  AFIO_REMAP_PARTIAL(AFIO_MAPR_USART3_REMAP_PARTIALREMAP, AFIO_MAPR_USART3_REMAP_FULLREMAP)

/**
 * @brief Disable the remapping of USART3 alternate function CTS, RTS, CK, TX and RX.
 * @note  DISABLE: No remap      (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
 * @retval None
 */
#define __HAL_AFIO_REMAP_USART3_DISABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_USART3_REMAP_NOREMAP, AFIO_MAPR_USART3_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM1 alternate function channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN)
 * @note  ENABLE: Full remap     (ETR/PE7,  CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8,  CH2N/PE10, CH3N/PE12)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM1_ENABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM1_REMAP_FULLREMAP, AFIO_MAPR_TIM1_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM1 alternate function channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN)
 * @note  PARTIAL: Partial remap (ETR/PA12, CH1/PA8, CH2/PA9,  CH3/PA10, CH4/PA11, BKIN/PA6,  CH1N/PA7,  CH2N/PB0,  CH3N/PB1)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM1_PARTIAL()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM1_REMAP_PARTIALREMAP, AFIO_MAPR_TIM1_REMAP_FULLREMAP)

/**
 * @brief Disable the remapping of TIM1 alternate function channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN)
 * @note  DISABLE: No remap      (ETR/PA12, CH1/PA8, CH2/PA9,  CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM1_DISABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM1_REMAP_NOREMAP, AFIO_MAPR_TIM1_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM2 alternate function channels 1 to 4 and external trigger (ETR)
 * @note  ENABLE: Full remap       (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM2_ENABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM2_REMAP_FULLREMAP, AFIO_MAPR_TIM2_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM2 alternate function channels 1 to 4 and external trigger (ETR)
 * @note  PARTIAL_2: Partial remap (CH1/ETR/PA0,  CH2/PA1, CH3/PB10, CH4/PB11)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM2_PARTIAL_2()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM2_REMAP_PARTIALREMAP2, AFIO_MAPR_TIM2_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM2 alternate function channels 1 to 4 and external trigger (ETR)
 * @note  PARTIAL_1: Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2,  CH4/PA3)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM2_PARTIAL_1()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM2_REMAP_PARTIALREMAP1, AFIO_MAPR_TIM2_REMAP_FULLREMAP)

/**
 * @brief Disable the remapping of TIM2 alternate function channels 1 to 4 and external trigger (ETR)
 * @note  DISABLE: No remap        (CH1/ETR/PA0,  CH2/PA1, CH3/PA2,  CH4/PA3)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM2_DISABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM2_REMAP_NOREMAP, AFIO_MAPR_TIM2_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM3 alternate function channels 1 to 4
 * @note  ENABLE: Full remap     (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)
 * @note  TIM3_ETR on PE0 is not re-mapped.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM3_ENABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM3_REMAP_FULLREMAP, AFIO_MAPR_TIM3_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM3 alternate function channels 1 to 4
 * @note  PARTIAL: Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
 * @note  TIM3_ETR on PE0 is not re-mapped.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM3_PARTIAL()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM3_REMAP_PARTIALREMAP, AFIO_MAPR_TIM3_REMAP_FULLREMAP)

/**
 * @brief Disable the remapping of TIM3 alternate function channels 1 to 4
 * @note  DISABLE: No remap      (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
 * @note  TIM3_ETR on PE0 is not re-mapped.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM3_DISABLE()  AFIO_REMAP_PARTIAL(AFIO_MAPR_TIM3_REMAP_NOREMAP, AFIO_MAPR_TIM3_REMAP_FULLREMAP)

/**
 * @brief Enable the remapping of TIM4 alternate function channels 1 to 4.
 * @note  ENABLE: Full remap (TIM4_CH1/PD12, TIM4_CH2/PD13, TIM4_CH3/PD14, TIM4_CH4/PD15)
 * @note  TIM4_ETR on PE0 is not re-mapped.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM4_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_TIM4_REMAP)

/**
 * @brief Disable the remapping of TIM4 alternate function channels 1 to 4.
 * @note  DISABLE: No remap  (TIM4_CH1/PB6,  TIM4_CH2/PB7,  TIM4_CH3/PB8,  TIM4_CH4/PB9)
 * @note  TIM4_ETR on PE0 is not re-mapped.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM4_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_TIM4_REMAP)

#if defined(AFIO_MAPR_CAN_REMAP_REMAP1)

/**
 * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
 * @note  CASE 1: CAN_RX mapped to PA11, CAN_TX mapped to PA12
 * @retval None
 */
#define __HAL_AFIO_REMAP_CAN1_1()  AFIO_REMAP_PARTIAL(AFIO_MAPR_CAN_REMAP_REMAP1, AFIO_MAPR_CAN_REMAP)

/**
 * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
 * @note  CASE 2: CAN_RX mapped to PB8,  CAN_TX mapped to PB9 (not available on 36-pin package)
 * @retval None
 */
#define __HAL_AFIO_REMAP_CAN1_2()  AFIO_REMAP_PARTIAL(AFIO_MAPR_CAN_REMAP_REMAP2, AFIO_MAPR_CAN_REMAP)

/**
 * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
 * @note  CASE 3: CAN_RX mapped to PD0,  CAN_TX mapped to PD1
 * @retval None
 */
#define __HAL_AFIO_REMAP_CAN1_3()  AFIO_REMAP_PARTIAL(AFIO_MAPR_CAN_REMAP_REMAP3, AFIO_MAPR_CAN_REMAP)

#endif

/**
 * @brief Enable the remapping of PD0 and PD1. When the HSE oscillator is not used
 *        (application running on internal 8 MHz RC) PD0 and PD1 can be mapped on OSC_IN and
 *        OSC_OUT. This is available only on 36, 48 and 64 pins packages (PD0 and PD1 are available
 *        on 100-pin and 144-pin packages, no need for remapping).
 * @note  ENABLE: PD0 remapped on OSC_IN, PD1 remapped on OSC_OUT.
 * @retval None
 */
#define __HAL_AFIO_REMAP_PD01_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_PD01_REMAP)

/**
 * @brief Disable the remapping of PD0 and PD1. When the HSE oscillator is not used
 *        (application running on internal 8 MHz RC) PD0 and PD1 can be mapped on OSC_IN and
 *        OSC_OUT. This is available only on 36, 48 and 64 pins packages (PD0 and PD1 are available
 *        on 100-pin and 144-pin packages, no need for remapping).
 * @note  DISABLE: No remapping of PD0 and PD1
 * @retval None
 */
#define __HAL_AFIO_REMAP_PD01_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_PD01_REMAP)

#if defined(AFIO_MAPR_TIM5CH4_IREMAP)
/**
 * @brief Enable the remapping of TIM5CH4.
 * @note  ENABLE: LSI internal clock is connected to TIM5_CH4 input for calibration purpose.
 * @note  This function is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM5CH4_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_TIM5CH4_IREMAP)

/**
 * @brief Disable the remapping of TIM5CH4.
 * @note  DISABLE: TIM5_CH4 is connected to PA3
 * @note  This function is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM5CH4_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_TIM5CH4_IREMAP)
#endif

#if defined(AFIO_MAPR_ETH_REMAP)
/**
 * @brief Enable the remapping of Ethernet MAC connections with the PHY.
 * @note  ENABLE: Remap     (RX_DV-CRS_DV/PD8, RXD0/PD9, RXD1/PD10, RXD2/PD11, RXD3/PD12)
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_REMAP_ETH_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_ETH_REMAP)

/**
 * @brief Disable the remapping of Ethernet MAC connections with the PHY.
 * @note  DISABLE: No remap (RX_DV-CRS_DV/PA7, RXD0/PC4, RXD1/PC5,  RXD2/PB0,  RXD3/PB1)
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_REMAP_ETH_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_ETH_REMAP)
#endif

#if defined(AFIO_MAPR_CAN2_REMAP)

/**
 * @brief Enable the remapping of CAN2 alternate function CAN2_RX and CAN2_TX.
 * @note  ENABLE: Remap     (CAN2_RX/PB5,  CAN2_TX/PB6)
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_REMAP_CAN2_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_CAN2_REMAP)

/**
 * @brief Disable the remapping of CAN2 alternate function CAN2_RX and CAN2_TX.
 * @note  DISABLE: No remap (CAN2_RX/PB12, CAN2_TX/PB13)
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_REMAP_CAN2_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_CAN2_REMAP)
#endif

#if defined(AFIO_MAPR_MII_RMII_SEL)
/**
 * @brief Configures the Ethernet MAC internally for use with an external MII or RMII PHY.
 * @note  ETH_RMII: Configure Ethernet MAC for connection with an RMII PHY
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_ETH_RMII() AFIO_REMAP_ENABLE(AFIO_MAPR_MII_RMII_SEL)

/**
 * @brief Configures the Ethernet MAC internally for use with an external MII or RMII PHY.
 * @note  ETH_MII: Configure Ethernet MAC for connection with an MII PHY
 * @note  This bit is available only in connectivity line devices and is reserved otherwise.
 * @retval None
 */
#define __HAL_AFIO_ETH_MII()  AFIO_REMAP_DISABLE(AFIO_MAPR_MII_RMII_SEL)
#endif

/**
 * @brief Enable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
 * @note  ENABLE: ADC1 External Event injected conversion is connected to TIM8 Channel4.
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC1_ETRGINJ_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_ADC1_ETRGINJ_REMAP)

/**
 * @brief Disable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
 * @note  DISABLE: ADC1 External trigger injected conversion is connected to EXTI15
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC1_ETRGINJ_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_ADC1_ETRGINJ_REMAP)

/**
 * @brief Enable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
 * @note  ENABLE: ADC1 External Event regular conversion is connected to TIM8 TRG0.
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC1_ETRGREG_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_ADC1_ETRGREG_REMAP)

/**
 * @brief Disable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
 * @note  DISABLE: ADC1 External trigger regular conversion is connected to EXTI11
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC1_ETRGREG_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_ADC1_ETRGREG_REMAP)

#if defined(AFIO_MAPR_ADC2_ETRGINJ_REMAP)

/**
 * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
 * @note  ENABLE: ADC2 External Event injected conversion is connected to TIM8 Channel4.
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC2_ETRGINJ_ENABLE()  AFIO_REMAP_ENABLE(AFIO_MAPR_ADC2_ETRGINJ_REMAP)

/**
 * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
 * @note  DISABLE: ADC2 External trigger injected conversion is connected to EXTI15
 * @retval None
 */
#define __HAL_AFIO_REMAP_ADC2_ETRGINJ_DISABLE() AFIO_REMAP_DISABLE(AFIO_MAPR_ADC2_ETRGINJ_REMAP)
#endif

