JRWaugh/stm32f103-cpp-hal/Core/Inc/AFIO.h
#if defined(AFIO_MAPR2_TIM17_REMAP)

/**
 * @brief Enable the remapping of TIM17_CH1.
 * @note  ENABLE: Remap     (TIM17_CH1 on PA7).
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM17_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM17_REMAP)

/**
 * @brief Disable the remapping of TIM17_CH1.
 * @note  DISABLE: No remap (TIM17_CH1 on PB9).
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM17_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM17_REMAP)
#endif

#if defined(AFIO_MAPR2_CEC_REMAP)

/**
 * @brief Enable the remapping of CEC.
 * @note  ENABLE: Remap     (CEC on PB10).
 * @retval None
 */
#define __HAL_AFIO_REMAP_CEC_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_CEC_REMAP)

/**
 * @brief Disable the remapping of CEC.
 * @note  DISABLE: No remap (CEC on PB8).
 * @retval None
 */
#define __HAL_AFIO_REMAP_CEC_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_CEC_REMAP)
#endif

#if defined(AFIO_MAPR2_TIM1_DMA_REMAP)

/**
 * @brief Controls the mapping of the TIM1_CH1 TIM1_CH2 DMA requests onto the DMA1 channels.
 * @note  ENABLE: Remap (TIM1_CH1 DMA request/DMA1 Channel6, TIM1_CH2 DMA request/DMA1 Channel6)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM1DMA_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM1_DMA_REMAP)

/**
 * @brief Controls the mapping of the TIM1_CH1 TIM1_CH2 DMA requests onto the DMA1 channels.
 * @note  DISABLE: No remap (TIM1_CH1 DMA request/DMA1 Channel2, TIM1_CH2 DMA request/DMA1 Channel3).
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM1DMA_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM1_DMA_REMAP)
#endif

#if defined(AFIO_MAPR2_TIM67_DAC_DMA_REMAP)

/**
 * @brief Controls the mapping of the TIM6_DAC1 and TIM7_DAC2 DMA requests onto the DMA1 channels.
 * @note  ENABLE: Remap (TIM6_DAC1 DMA request/DMA1 Channel3, TIM7_DAC2 DMA request/DMA1 Channel4)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM67DACDMA_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM67_DAC_DMA_REMAP)

/**
 * @brief Controls the mapping of the TIM6_DAC1 and TIM7_DAC2 DMA requests onto the DMA1 channels.
 * @note  DISABLE: No remap (TIM6_DAC1 DMA request/DMA2 Channel3, TIM7_DAC2 DMA request/DMA2 Channel4)
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM67DACDMA_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM67_DAC_DMA_REMAP)
#endif

#if defined(AFIO_MAPR2_TIM12_REMAP)

/**
 * @brief Enable the remapping of TIM12_CH1 and TIM12_CH2.
 * @note  ENABLE: Remap     (TIM12_CH1 on PB12 and TIM12_CH2 on PB13).
 * @note  This bit is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM12_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM12_REMAP)

/**
 * @brief Disable the remapping of TIM12_CH1 and TIM12_CH2.
 * @note  DISABLE: No remap (TIM12_CH1 on PC4  and TIM12_CH2 on PC5).
 * @note  This bit is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_TIM12_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_TIM12_REMAP)
#endif

#if defined(AFIO_MAPR2_MISC_REMAP)

/**
 * @brief Miscellaneous features remapping.
 *        This bit is set and cleared by software. It controls miscellaneous features.
 *        The DMA2 channel 5 interrupt position in the vector table.
 *        The timer selection for DAC trigger 3 (TSEL[2:0] = 011, for more details refer to the DAC_CR register).
 * @note  ENABLE: DMA2 channel 5 interrupt is mapped separately at position 60 and TIM15 TRGO event is
 *        selected as DAC Trigger 3, TIM15 triggers TIM1/3.
 * @note  This bit is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_MISC_ENABLE()  SET_BIT(AFIO->MAPR2, AFIO_MAPR2_MISC_REMAP)

/**
 * @brief Miscellaneous features remapping.
 *        This bit is set and cleared by software. It controls miscellaneous features.
 *        The DMA2 channel 5 interrupt position in the vector table.
 *        The timer selection for DAC trigger 3 (TSEL[2:0] = 011, for more details refer to the DAC_CR register).
 * @note  DISABLE: DMA2 channel 5 interrupt is mapped with DMA2 channel 4 at position 59, TIM5 TRGO
 *        event is selected as DAC Trigger 3, TIM5 triggers TIM1/3.
 * @note  This bit is available only in high density value line devices.
 * @retval None
 */
#define __HAL_AFIO_REMAP_MISC_DISABLE() CLEAR_BIT(AFIO->MAPR2, AFIO_MAPR2_MISC_REMAP)
#endif

#define AFIO_REMAP_ENABLE(REMAP_PIN)       do{ uint32_t tmpreg = AFIO->MAPR; \
		tmpreg |= AFIO_MAPR_SWJ_CFG;  \
		tmpreg |= REMAP_PIN;          \
		AFIO->MAPR = tmpreg;          \
}while(0u)

#define AFIO_REMAP_DISABLE(REMAP_PIN)      do{ uint32_t tmpreg = AFIO->MAPR;  \
		tmpreg |= AFIO_MAPR_SWJ_CFG;   \
		tmpreg &= ~REMAP_PIN;          \
		AFIO->MAPR = tmpreg;           \
}while(0u)

#define AFIO_REMAP_PARTIAL(REMAP_PIN, REMAP_PIN_MASK) do{ uint32_t tmpreg = AFIO->MAPR; \
		tmpreg &= ~REMAP_PIN_MASK;    \
		tmpreg |= AFIO_MAPR_SWJ_CFG;  \
		tmpreg |= REMAP_PIN;          \
		AFIO->MAPR = tmpreg;          \
}while(0u)

#define AFIO_DBGAFR_CONFIG(DBGAFR_SWJCFG)  do{ uint32_t tmpreg = AFIO->MAPR;     \
		tmpreg &= ~AFIO_MAPR_SWJ_CFG_Msk; \
		tmpreg |= DBGAFR_SWJCFG;          \
		AFIO->MAPR = tmpreg;              \
}while(0u)

extern struct AFIO {
public:
	void* operator new(size_t) {
		return reinterpret_cast<void *>(AFIO_BASE);
	}

	void config_event_output(uint32_t GPIO_PortSource, uint32_t GPIO_PinSource) {
		MODIFY_REG(EVCR, (AFIO_EVCR_PORT) | (AFIO_EVCR_PIN), (GPIO_PortSource) | (GPIO_PinSource));
	}

	void enable_event_output() {
		EVCR |= AFIO_EVCR_EVOE;
	}

	void disable_event_output() {
		EVCR &= ~AFIO_EVCR_EVOE;
	}

	__IO uint32_t EVCR;
	__IO uint32_t MAPR;
	__IO uint32_t EXTICR[4];
	uint32_t RESERVED0;
	__IO uint32_t MAPR2;
}& afio;

#endif /* SRC_AFIO_H_ */
